<!DOCTYPE html>
<html lang="es">
    <head>
        <meta charset="utf-8">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <link rel="stylesheet" href="css/style.css" title="Color">
        <title>Biografia</title>
      </head>

    <body>
        <h1>Biografia Alan Turing<br>1912-1954<br>
        <img src="img/alanturin.jpg" width="20%">
        </h1>

        <p>En este apartado se podr&aacute; visualizar una breve l&iacute;nea del tiempo sobre el matem&aacute;tico/inform&aacute;tico Alan Turing</p>

        <ul>
            <li><a href="#1912">1912</a></li>
            <li><a href="#1920-1930">1920-1930</a></li>
            <li><a href="#1930-1940">1930-1940</a></li>
            <li><a href="#1940-1950">1940-1950</a></li>
            <li><a href="#1950-1960">1950-1960</a></li>
        </ul>

        <h2 id="1912">1912</h2>
        <p><li>Nace el 23 de junio de 1912 en Maida Vale, Reino Unido. Era hijo de Julius Mathison Turing, miembro del cuerpo de funcionarios brit&aacute;nicos en la India. Su madre era Ethel Sara Stoney, hija del ingeniero jefe de Madras Railways.</li></p>

        <h2 id="1920-1930">1920-1930</h2>
        <p><li>1922 Estudia en la preparatoria de Hazelhurst, una escuela independiente en Frant, Sussex.</li><br><li>1926 Ingresa en el internado de Sherborne en Dorset.</li><br>
        <li>1930 El 13 de febrero fallece su amigo Christopher Morcom debido a la tuberculosis bovina. Tras graduarse en la Universidad de Cambridge, se traslada a Estados Unidos a la Universidad de Princeton donde trabaja con el l&oacute;gico Alonzo Church, creador de la base de la computaci&oacute;n te&oacute;rica. All&iacute; tambi&eacute;n conoce a Godfrey Harold Hardy.</li></p>
    
        <h2 id="1930-1940">1930-1940</h2>
        <p><li>1935  Es nombrado profesor del King’s College</li><br><li>1936 Formaliz&oacute; los conceptos de algoritmo y la computaci&oacute;n: la m&aacute;quina de Turing. Formula su versi&oacute;n de la tesis de Church Turing</li><br>
        <li>1936 En su trabajo acerca de los n&uacute;meros computables, introduce el concepto de la m&aacute;quina de Turing. Adem&aacute;s, junto a Alonzo Church, demuestra que es imposible escribir un algoritmo para resolver el problema de decisi&oacute;n expuesto por Leibniz en el siglo XVII.</li><br>
        <li>1938 Regresa a Cambridge donde estudia filosof&iacute;a de las matem&aacute;ticas.</li><br><li>1938 Obtiene el Doctorado en Princeton e introduce el concepto de hipercomputaci&oacute;n.</li><br><li>1939 Durante la Segunda Guerra Mundial trabaj&oacute; para descifrar los c&oacute;digos nazis, especialmente los de la m&aacute;quina Enigma. Fue director de la secci&oacute;n Naval Enigma.</li></p>

        <h2 id="1940-1950">1940-1950</h2>
        <p><li>1945 Se traslada a Richmond, Londres, donde trabaja en el Laboratorio Nacional de F&iacute;sica.</li><br><li>1947 Comienza a trabajar en el diseño del ACE (Automatic Computer Engine, o motor de computaci&oacute;n autom&aacute;tica). Posteriormente cre&oacute; el Abbreviated Conde Instruction, el cual dio origen a los lenguajes de programaci&oacute;n.</li><br>
        <li>1948 Es nombrado director delegado del laboratorio de inform&aacute;tica de la Universidad de Manchester. Trabaj&oacute; en el software de una de las primeras computadoras reales, la Manchester Mark I.</li><br>
        <li>1950 En el campo de la Inteligencia artificial se le conoce por la concepci&oacute;n de la prueba de Turing, seg&uacute;n la cual un criterio para juzgar la inteligencia de una m&aacute;quina ser&iacute;a si sus respuestas en la prueba son indistinguibles de las de un ser humano.</li></p>

        <h2 id="1950-1960">1950-1960</h2>
        <p><li>1950 Publica Computing machinery and intelligence.</li><br><li>1952 Intenta implementar un programa de ajedrez en el Ferranti Mark I pero el ordenador no pudo ejecutar el programa por falta de potencia.</li><br>
        <li>1952 Comienza a trabajar en biolog&iacute;a matem&aacute;tica</li><br><li>1952 Turing es procesado por homosexualidad (considerada un delito en el Reino Unido en ese momento) y opta por la castraci&oacute;n qu&iacute;mica como alternativa a la prisi&oacute;n.</li><br>
        <li>1954 Alan Turing muere el 7 de junio, en Wilmslow, Cheshire, Inglaterra, en lo que se considera generalmente como un suicidio por envenenamiento con cianuro.</li></p>
    </body>
</html>

